<?php
$_php = "localhost是本地的意思，www目录是网站的根目录。\r\n";
echo $_php;
echo "phpinfo();展示的是php的版本内容。\n";
echo "phpinfo() 后面还接了一个分号（;），并且在phpinfo()的上一行和后一行，还有两个回车符。\n";
echo "phpinfo是一个函数（功能），这个函数（功能）会显示一个当前电脑（服务器）的详细的PHP信息。在后面会专门为大家讲解phpinfo()这个函数。这个函数必须要大家记住！电脑是一个很笨的东西。他需要我们人为的告诉他，代码写完了。我们用分号（;）来告诉他代码写完了。因此，只要我们写完一段代码，就需要在后面加分号（;）。而前后两行的回车空行，是为了让代码更加好看，避免叠在一起，让人看着不舒服。其实，中间你有多少个回车空行都没有关系的，保证好看就行了。PHP的语法解释器（PHP最核心的部份）不会处理这些空行的。php的代码部份全部要用半角的英文、很多人容易写成全角的英文和符号造成PHP代码报错。\n
PHP代码的最后一行可以加也可不加分号。由于很多学习者特别是初学者经常犯一个毛病：写完一行代码不加分号。因此，容易报错。我们通常在公司里面规定：一行代码写完，就必须要加分号。\n
我们在写文件php这个文件命名的时候，只用英文半脚（a-zA-Z0-9_-）这些字符来命名文件。文件命名不要用中文，不要用特殊附号，不要中间加空格，严格区分大小。\n";
// echo phpinfo();
?>